In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
fname = ["Paul", "John", "Richard", "George"]

In [6]:
lname = ["McCartney", "Lennon", "Starkey", "Harrison"]

In [7]:
birth = [1942, 1940, 1940, 1943]

In [8]:
people = {"first": fname, "last": lname, "birth": birth}

In [9]:
beatles = pd.DataFrame(people)

In [10]:
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [11]:
beatles.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
pd.DataFrame(people, index=["a", "b", "c", "d"])

     first       last  birth
a     Paul  McCartney   1942
b     John     Lennon   1940
c  Richard    Starkey   1940
d   George   Harrison   1943

In [13]:
pd.DataFrame(
    [
        {
            "first": "Paul",
            "last": "McCartney",
            "birth": 1942
        },
        {
            "first": "John",
            "last": "Lennon",
            "birth": 1940
        },
        {
            "first": "Richard",
            "last": "Starkey",
            "birth": 1940
        },
        {
            "first": "George",
            "last": "Harrison",
            "birth": 1943
        }
    ]
)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [14]:
pd.DataFrame(
    [
        {
            "first": "Paul",
            "last": "McCartney",
            "birth": 1942
        },
        {
            "first": "John",
            "last": "Lennon",
            "birth": 1940
        },
        {
            "first": "Richard",
            "last": "Starkey",
            "birth": 1940
        },
        {
            "first": "George",
            "last": "Harrison",
            "birth": 1943
        }
    ],
    columns=["last", "first", "birth"]
)

        last    first  birth
0  McCartney     Paul   1942
1     Lennon     John   1940
2    Starkey  Richard   1940
3   Harrison   George   1943

In [15]:
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [16]:
from io import StringIO

In [17]:
fout = StringIO()

In [18]:
beatles.to_csv(fout)

In [19]:
print(fout.getvalue())

,first,last,birth
0,Paul,McCartney,1942
1,John,Lennon,1940
2,Richard,Starkey,1940
3,George,Harrison,1943

In [20]:
_ = fout.seek(0)

In [21]:
pd.read_csv(fout)

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [22]:
_ = fout.seek(0)

In [23]:
pd.read_csv(fout, index_col=0)

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [24]:
fout = StringIO()

In [25]:
beatles.to_csv(fout, index=False)

In [26]:
print(fout.getvalue())

first,last,birth
Paul,McCartney,1942
John,Lennon,1940
Richard,Starkey,1940
George,Harrison,1943

In [27]:
beatles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   4 non-null      object
 1   last    4 non-null      object
 2   birth   4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [28]:
diamonds = pd.read_csv("diamonds.csv", nrows=1000)

In [29]:
diamonds

     carat      cut color clarity  depth  table  price     x     y     z
0     0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1     0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2     0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3     0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4     0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
..     ...      ...   ...     ...    ...    ...    ...   ...   ...   ...
995   0.54    Ideal     D    VVS2   61.4   52.0   2897  5.30  5.34  3.26
996   0.72    Ideal     E     SI1   62.5   55.0   2897  5.69  5.74  3.57
997   0.72     Good     F     VS1   59.4   61.0   2897  5.82  5.89  3.48
998   0.74  Premium     D     VS2   61.8   58.0   2897  5.81  5.77  3.58
999   1.12  Premium     J     SI2   60.6   59.0   2898  6.68  6.61  4.03

[1000 rows x 10 columns]

In [30]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.2+ KB

In [31]:
diamonds2 = pd.read_csv(
    "diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "x": np.float32,
        "y": np.float32,
        "z": np.float32,
        "price": np.int16
    },
)

In [32]:
diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: float32(6), int16(1), object(3)
memory usage: 49.0+ KB

In [33]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722800,57.734700,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758879,2.467946,839.57562,0.625173,0.611974,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900000,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.800000,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.600000,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [34]:
diamonds2.describe()

,carat,depth,table,price,x,y,z
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,0.689280,61.722801,57.734699,2476.54000,5.605940,5.599180,3.457530
std,0.195291,1.758879,2.467946,839.57562,0.625173,0.611974,0.389819
min,0.200000,53.000000,52.000000,326.00000,3.790000,3.750000,2.270000
25%,0.700000,60.900002,56.000000,2777.00000,5.640000,5.630000,3.450000
50%,0.710000,61.799999,57.000000,2818.00000,5.770000,5.760000,3.550000
75%,0.790000,62.599998,59.000000,2856.00000,5.920000,5.910000,3.640000
max,1.270000,69.500000,70.000000,2898.00000,7.120000,7.050000,4.330000

In [35]:
diamonds2.cut.value_counts()

Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: cut, dtype: int64

In [36]:
diamonds2.color.value_counts()

E    240
F    226
G    139
D    129
H    125
I     95
J     46
Name: color, dtype: int64

In [37]:
diamonds2.clarity.value_counts()

SI1     306
VS2     218
VS1     159
SI2     154
VVS2     62
VVS1     58
I1       29
IF       14
Name: clarity, dtype: int64

In [38]:
diamonds3 = pd.read_csv(
    "diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "x": np.float32,
        "y": np.float32,
        "z": np.float32,
        "price": np.int16,
        "cut": "category",
        "color": "category",
        "clarity": "category"
    }
)

In [39]:
diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
 7   x        1000 non-null   float32
 8   y        1000 non-null   float32
 9   z        1000 non-null   float32
dtypes: category(3), float32(6), int16(1)
memory usage: 29.4 KB

In [40]:
cols = [
    "carat",
    "cut",
    "color",
    "clarity",
    "depth",
    "table",
    "price"
]

In [41]:
diamonds4 = pd.read_csv(
    "diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "price": np.int16,
        "cut": "category",
        "color": "category",
        "clarity": "category"
    },
    usecols=cols
)

In [42]:
diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float32
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float32
 5   table    1000 non-null   float32
 6   price    1000 non-null   int16
dtypes: category(3), float32(3), int16(1)
memory usage: 17.6 KB

In [43]:
cols = [
    "carat",
    "cut",
    "color",
    "clarity",
    "depth",
    "table",
    "price"
]

In [44]:
diamonds_iter = pd.read_csv(
    "diamonds.csv",
    nrows=1000,
    dtype={
        "carat": np.float32,
        "depth": np.float32,
        "table": np.float32,
        "price": np.int16,
        "cut": "category",
        "color": "category",
        "clarity": "category"
    },
    usecols=cols,
    chunksize=200
)

In [45]:
def process(df):
    return f"processed {df.size} items"

In [46]:
for chunk in diamonds_iter:
    process(chunk)

In [47]:
np.iinfo(np.int8)

iinfo(min=-128, max=127, dtype=int8)

In [48]:
np.iinfo(np.int16)

iinfo(min=-32768, max=32767, dtype=int16)

In [49]:
np.iinfo(np.int64)

iinfo(min=-9223372036854775808, max=9223372036854775807, dtype=int64)

In [50]:
np.finfo(np.float16)

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [51]:
diamonds.price.memory_usage()

8128

In [52]:
diamonds.price.memory_usage(index=False)

8000

In [53]:
diamonds.cut.memory_usage()

8128

In [54]:
diamonds.cut.memory_usage(deep=True)

63461

In [55]:
diamonds4.to_feather("d.arr")

In [56]:
diamonds5 = pd.read_feather("d.arr")

In [57]:
diamonds4.to_parquet("d.pqt")

In [58]:
beatles.to_excel("beat.xls")

<ipython-input-58-413087c69e85>:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  beatles.to_excel("beat.xls")

In [59]:
beatles.to_excel("beat.xlsx")

In [60]:
beat2 = pd.read_excel("beat.xls")

In [61]:
beat2

   Unnamed: 0    first       last  birth
0           0     Paul  McCartney   1942
1           1     John     Lennon   1940
2           2  Richard    Starkey   1940
3           3   George   Harrison   1943

In [62]:
beat2 = pd.read_excel("beat.xls", index_col=0)

In [63]:
beat2

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [64]:
beat2.dtypes

first    object
last     object
birth     int64
dtype: object

In [65]:
xl_writer = pd.ExcelWriter("beat2.xlsx")

In [66]:
beatles.to_excel(xl_writer, sheet_name="All")

In [67]:
beatles[beatles.birth < 1941].to_excel(
    xl_writer, sheet_name="1940"
)

In [68]:
xl_writer.save()

In [69]:
autos = pd.read_csv("vehicles.csv.zip")

/home/rkeim/.local/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3155: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [70]:
autos

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39096,14.982273,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39097,14.330870,0.0,0.0,0.0,20,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39098,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39099,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
39100,18.311667,0.0,0.0,0.0,16,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

In [71]:
autos.modifiedOn.dtype

dtype('O')

In [72]:
pd.to_datetime(autos.modifiedOn)

/usr/lib/python3/dist-packages/dateutil/parser/_parser.py:1199: UnknownTimezoneWarning: tzname EST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "
/usr/lib/python3/dist-packages/dateutil/parser/_parser.py:1199: UnknownTimezoneWarning: tzname EDT identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [73]:
autos = pd.read_csv("vehicles.csv.zip", parse_dates=["modifiedOn"])

/home/rkeim/.local/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3155: DtypeWarning: Columns (70,71,72,73,74,76,79) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [74]:
autos.modifiedOn

0       2013-01-01
1       2013-01-01
2       2013-01-01
3       2013-01-01
4       2013-01-01
           ...
39096   2013-01-01
39097   2013-01-01
39098   2013-01-01
39099   2013-01-01
39100   2013-01-01
Name: modifiedOn, Length: 39101, dtype: datetime64[ns]

In [75]:
import zipfile

In [77]:
with zipfile.ZipFile("kaggle-survey-2018.zip") as z:
        print("\n".join(z.namelist()))
        kag = pd.read_csv(
            z.open("multipleChoiceResponses.csv")
        )
        kag_questions = kag.iloc[0]
        survey = kag.iloc[1:]

multipleChoiceResponses.csv
freeFormResponses.csv
SurveySchema.csv

In [80]:
survey.head(2).T

                                                            1          2
Time from Start to Finish (seconds)                       710        434
Q1                                                     Female       Male
Q1_OTHER_TEXT                                              -1         -1
Q2                                                      45-49      30-34
Q3                                   United States of America  Indonesia
...                                                       ...        ...
Q50_Part_5                                                NaN        NaN
Q50_Part_6                                                NaN        NaN
Q50_Part_7                                                NaN        NaN
Q50_Part_8                                                NaN        NaN
Q50_OTHER_TEXT                                             -1         -1

[395 rows x 2 columns]

In [81]:
import sqlite3

In [82]:
con = sqlite3.connect("beat.db")

In [85]:
with con:
    cur = con.cursor()
    #cur.execute("""DROP TABLE Band""")
    cur.execute(
        """CREATE TABLE Band(
        id INTEGER PRIMARY KEY,
        fname TEXT, lname TEXT,
        birthyear INT)"""
    )
    cur.execute(
        """INSERT INTO Band VALUES(
        0, 'Paul', 'McCartney', 1942
        )"""
    )
    cur.execute(
        """INSERT INTO Band VALUES(
        1, 'John', 'Lennon', 1940
        )"""
    )
    _ = con.commit()

In [87]:
import sqlalchemy as sa

In [91]:
engine = sa.create_engine(
    "sqlite:///beat.db",
    echo=True
)

In [92]:
sa_connection = engine.connect()

2021-02-23 06:13:11,540 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2021-02-23 06:13:11,541 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:13:11,544 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2021-02-23 06:13:11,545 INFO sqlalchemy.engine.base.Engine ()

In [94]:
beat = pd.read_sql(
    "Band",
    sa_connection,
    index_col="id"
)

2021-02-23 06:15:01,857 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("Band")
2021-02-23 06:15:01,859 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,861 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2021-02-23 06:15:01,862 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,865 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_xinfo("Band")
2021-02-23 06:15:01,866 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,867 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-02-23 06:15:01,868 INFO sqlalchemy.engine.base.Engine ('Band',)
2021-02-23 06:15:01,869 INFO sqlalchemy.engine.base.Engine PRAGMA main.foreign_key_list("Band")
2021-02-23 06:15:01,870 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,870 INFO sqlalchemy.engine.base.Engine PRAGMA temp.foreign_key_list("Band")
2021-02-23 06:15:01,871 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,872 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-02-23 06:15:01,872 INFO sqlalchemy.engine.base.Engine ('Band',)
2021-02-23 06:15:01,876 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("Band")
2021-02-23 06:15:01,877 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,878 INFO sqlalchemy.engine.base.Engine PRAGMA temp.index_list("Band")
2021-02-23 06:15:01,878 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,879 INFO sqlalchemy.engine.base.Engine PRAGMA main.index_list("Band")
2021-02-23 06:15:01,879 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,880 INFO sqlalchemy.engine.base.Engine PRAGMA temp.index_list("Band")
2021-02-23 06:15:01,881 INFO sqlalchemy.engine.base.Engine ()
2021-02-23 06:15:01,881 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = ? AND type = 'table'
2021-02-23 06:15:01,882 INFO sqlalchemy.engine.base.Engine ('Band',)
2021-02-23 06:15:01,884 INFO sqlalchemy.engine.base.Engine SELECT "Band".id, "Band".fname, "Band".lname, "Band".birthyear
FROM "Band"
2021-02-23 06:15:01,885 INFO sqlalchemy.engine.base.Engine ()

In [95]:
beat

   fname      lname  birthyear
id
0   Paul  McCartney       1942
1   John     Lennon       1940

In [96]:
sql = """SELECT fname, birthyear FROM Band"""

In [97]:
fnames = pd.read_sql(sql, con)

In [98]:
fnames

  fname  birthyear
0  Paul       1942
1  John       1940

In [99]:
import json

In [100]:
encoded = json.dumps(people)

In [101]:
encoded

'{"first": ["Paul", "John", "Richard", "George"], "last": ["McCartney", "Lennon", "Starkey", "Harrison"], "birth": [1942, 1940, 1940, 1943]}'

In [102]:
json.loads(encoded)

{'first': ['Paul', 'John', 'Richard', 'George'],
 'last': ['McCartney', 'Lennon', 'Starkey', 'Harrison'],
 'birth': [1942, 1940, 1940, 1943]}

In [103]:
beatles = pd.read_json(encoded)

In [104]:
beatles

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [105]:
records = beatles.to_json(orient="records")

In [106]:
records

'[{"first":"Paul","last":"McCartney","birth":1942},{"first":"John","last":"Lennon","birth":1940},{"first":"Richard","last":"Starkey","birth":1940},{"first":"George","last":"Harrison","birth":1943}]'

In [107]:
pd.read_json(records, orient="records")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [108]:
split = beatles.to_json(orient="split")

In [109]:
split

'{"columns":["first","last","birth"],"index":[0,1,2,3],"data":[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]}'

In [110]:
pd.read_json(split, orient="split")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [111]:
index = beatles.to_json(orient="index")

In [112]:
index

'{"0":{"first":"Paul","last":"McCartney","birth":1942},"1":{"first":"John","last":"Lennon","birth":1940},"2":{"first":"Richard","last":"Starkey","birth":1940},"3":{"first":"George","last":"Harrison","birth":1943}}'

In [113]:
pd.read_json(index, orient="index")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [114]:
values = beatles.to_json(orient="values")

In [115]:
values

'[["Paul","McCartney",1942],["John","Lennon",1940],["Richard","Starkey",1940],["George","Harrison",1943]]'

In [116]:
pd.read_json(values, orient="values")

         0          1     2
0     Paul  McCartney  1942
1     John     Lennon  1940
2  Richard    Starkey  1940
3   George   Harrison  1943

In [118]:
pd.read_json(values, orient="values").rename(columns=dict(enumerate(["first", "last", "birth"])))

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [119]:
table = beatles.to_json(orient="table")

In [120]:
table

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"first","type":"string"},{"name":"last","type":"string"},{"name":"birth","type":"integer"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":0,"first":"Paul","last":"McCartney","birth":1942},{"index":1,"first":"John","last":"Lennon","birth":1940},{"index":2,"first":"Richard","last":"Starkey","birth":1940},{"index":3,"first":"George","last":"Harrison","birth":1943}]}'

In [121]:
pd.read_json(table, orient="table")

     first       last  birth
0     Paul  McCartney   1942
1     John     Lennon   1940
2  Richard    Starkey   1940
3   George   Harrison   1943

In [122]:
output = beat.to_dict()

In [123]:
output

{'fname': {0: 'Paul', 1: 'John'},
 'lname': {0: 'McCartney', 1: 'Lennon'},
 'birthyear': {0: 1942, 1: 1940}}

In [124]:
output["version"] = "0.4.1"

In [125]:
json.dumps(output)

'{"fname": {"0": "Paul", "1": "John"}, "lname": {"0": "McCartney", "1": "Lennon"}, "birthyear": {"0": 1942, "1": 1940}, "version": "0.4.1"}'

In [136]:
url = 'https://en.wikipedia.org/wiki/The_Beatles_discography'

In [137]:
dfs = pd.read_html(url)

In [138]:
len(dfs)

51

In [140]:
dfs[0]

,The Beatles discography,The Beatles discography.1
0,The Beatles in 1964Clockwise (from top-left): ...,The Beatles in 1964Clockwise (from top-left): ...
1,Studio albums,23
2,Live albums,5
3,Compilation albums,54
4,Video albums,22
5,Music videos,68
6,EPs,35
7,Singles,63
8,Mash-ups,2
9,Box sets,17

In [141]:
dfs = pd.read_html(
    url, match="List of studio albums", na_values="-"
)

In [142]:
len(dfs)

1

In [143]:
dfs[0].columns

MultiIndex([(               'Title',          'Title'),
            (       'Album details',  'Album details'),
            ('Peak chart positions',       'UK[1][2]'),
            ('Peak chart positions',         'AUS[3]'),
            ('Peak chart positions',         'CAN[4]'),
            ('Peak chart positions',         'FRA[5]'),
            ('Peak chart positions',         'GER[6]'),
            ('Peak chart positions',         'NOR[7]'),
            ('Peak chart positions',       'US[8][9]'),
            (      'Certifications', 'Certifications')],
           )

In [145]:
dfs = pd.read_html(
    url,
    match="List of studio albums",
    na_values="-",
    header=[0, 1]
)

In [146]:
len(dfs)

1

In [147]:
dfs[0]

                                                Title  \
                                                Title
0                                    Please Please Me
1                                 With the Beatles[B]
2                          Introducing... The Beatles
3                                   Meet the Beatles!
4                                     Twist and Shout
5                           The Beatles' Second Album
6                        The Beatles' Long Tall Sally
7                                  A Hard Day's Night
8                                  A Hard Day's Night
9                                       Something New
10                                   Beatles for Sale
11                                        Beatles '65
12                                         Beatles VI
13                                              Help!
14                                              Help!
15                                        Rubber Soul
16                                        Rubber Soul
17                                Yesterday and Today
18                                           Revolver
19                                           Revolver
20              Sgt. Pepper's Lonely Hearts Club Band
21                               Magical Mystery Tour
22                    The Beatles ("The White Album")
23                                Yellow Submarine[F]
24                                         Abbey Road
25                                          Let It Be
26  "—" denotes that the recording did not chart o...

                                        Album details  \
                                        Album details
0      Released: 22 March 1963 Label: Parlophone (UK)
1   Released: 22 November 1963 Label: Parlophone (...
2       Released: 10 January 1964 Label: Vee-Jay (US)
3       Released: 20 January 1964 Label: Capitol (US)
4      Released: 3 February 1964 Label: Capitol (CAN)
5         Released: 10 April 1964 Label: Capitol (US)
6          Released: 11 May 1964 Label: Capitol (CAN)
7   Released: 26 June 1964 Label: United Artists (...
8       Released: 10 July 1964 Label: Parlophone (UK)
9          Released: 20 July 1964 Label: Capitol (US)
10   Released: 4 December 1964 Label: Parlophone (UK)
11     Released: 15 December 1964 Label: Capitol (US)
12  Released: 14 June 1965 Label: Parlophone (NZ),...
13     Released: 6 August 1965 Label: Parlophone (UK)
14  Released: 13 August 1965 Label: Capitol (US)[C...
15   Released: 3 December 1965 Label: Parlophone (UK)
16   Released: 6 December 1965 Label: Capitol (US)[C]
17         Released: 20 June 1966 Label: Capitol (US)
18     Released: 5 August 1966 Label: Parlophone (UK)
19     Released: 8 August 1966 Label: Capitol (US)[C]
20  Released: 26 May 1967 Label: Parlophone (UK), ...
21  Released: 27 November 1967[E] Label: Parlophon...
22            Released: 22 November 1968 Label: Apple
23  Released: 13 January 1969 Label: Apple (UK), C...
24           Released: 26 September 1969 Label: Apple
25                  Released: 8 May 1970 Label: Apple
26  "—" denotes that the recording did not chart o...

                                 Peak chart positions  \
                                             UK[1][2]
0                                                   1
1                                                   1
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                   —
7                                                   —
8                                                   1
9                                                   —
10                                                  1
11                                                  —
12                                                  —
13                                                  1
14                                                  —
15                                                  1
16                                                  —
17                                                  —
18                                                  1
19                                                  —
20                                                  1
21                                                 31
22                                                  1
23                                                  3
24                                                  1
25                                                  1
26  "—" denotes that the recording did not chart o...

                                                       \
                                               AUS[3]
0                                                   —
1                                                   —
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                   —
7                                                   —
8                                                   1
9                                                   —
10                                                  1
11                                                  —
12                                                  —
13                                                  1
14                                                  —
15                                                  1
16                                                  —
17                                                  —
18                                                  1
19                                                  —
20                                                  1
21                                                 48
22                                                  1
23                                                  4
24                                                  1
25                                                  1
26  "—" denotes that the recording did not chart o...

                                                       \
                                               CAN[4]
0                                                   —
1                                                   —
2                                                   —
3                                                   1
4                                                   1
5                                                   1
6                                                   1
7                                                   1
8                                                   —
9                                                   2
10                                                  —
11                                                  1
12                                                  1
13                                                  —
14                                                  1
15                                                  —
16                                                  1
17                                                  1
18                                                  —
19                                                  1
20                                                  1
21                                                  —
22                                                  1
23                                                  1
24                                                  1
25                                                  1
26  "—" denotes that the recording did not chart o...

                                                       \
                                               FRA[5]
0                                                   5
1                                                   5
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                   —
7                                                   5
8                                                   —
9                                                   —
10                                                  —
11                                                 80
12                                                  —
13                                                  5
14                                                  —
15                                                  5
16                                                  —
17                                                  —
18                                                  5
19                                                  —
20                                                  4
21                                                  2
22                                                  1
23                                                  4
24                                                  1
25                                                  5
26  "—" denotes that the recording did not chart o...

                                                       \
                                               GER[6]
0                                                   5
1                                                   1
2                                                   —
3                                                   —
4                                                   —
5                                                  50
6                                                   —
7                                                   —
8                                                   1
9                                                  38
10                                                  1
11                                                  9
12                                                 15
13                                                  1
14                                                  —
15                                                  1
16                                                  —
17                                                 13
18                                                  1
19                                                  —
20                                                  1
21                                                  8
22                                                  1
23                                                  5
24                                                  1
25                                                  4
26  "—" denotes that the recording did not chart o...

                                                       \
                                               NOR[7]
0                                                   —
1                                                   —
2                                                   —
3                                                   —
4                                                   —
5                                                   —
6                                                   —
7                                                   —
8                                                   —
9                                                   —
10                                                  —
11                                                  —
12                                                  —
13                                                  —
14                                                  —
15                                                  —
16                                                  —
17                                                  —
18                                                 14
19                                                  —
20                                                  1
21                                                 13
22                                                  1
23                                                  1
24                                                  1
25                                                  1
26  "—" denotes that the recording did not chart o...

                                                       \
                                             US[8][9]
0                                                   —
1                                                   —
2                                                   2
3                                                   1
4                                                   —
5                                                   1
6                                                   —
7                                                   1
8                                                   —
9                                                   2
10                                                  —
11                                                  1
12                                                  1
13                                                  —
14                                                  1
15                                                  —
16                                                  1
17                                                  1
18                                                  —
19                                                  1
20                                                  1
21                                                  1
22                                                  1
23                                                  2
24                                                  1
25                                                  1
26  "—" denotes that the recording did not chart o...

                                       Certifications
                                       Certifications
0   BPI: Platinum[10] ARIA: Gold[11] MC: Gold[12] ...
1   BPI: Gold[10] ARIA: Gold[11] BVMI: Gold[14] MC...
2                                  RIAA: Platinum[13]
3              MC: Platinum[12] RIAA: 5× Platinum[13]
4                                 MC: 3× Platinum[12]
5              MC: Platinum[12] RIAA: 2× Platinum[13]
6                                        MC: Gold[12]
7              MC: Platinum[12] RIAA: 4× Platinum[13]
8                    BPI: Platinum[10] ARIA: Gold[11]
9                  MC: Gold[12] RIAA: 2× Platinum[13]
10  BPI: Gold[10] ARIA: Gold[11] MC: Gold[12] RIAA...
11             MC: Platinum[12] RIAA: 3× Platinum[13]
12                    MC: Gold[12] RIAA: Platinum[13]
13                   BPI: Platinum[10] ARIA: Gold[11]
14          MC: 2× Platinum[12] RIAA: 3× Platinum[13]
15  BPI: Platinum[10] ARIA: Platinum[11] BVMI: Gol...
16          MC: 2× Platinum[12] RIAA: 6× Platinum[13]
17             MC: Platinum[12] RIAA: 2× Platinum[13]
18            BPI: 2× Platinum[10] ARIA: Platinum[11]
19          MC: 2× Platinum[12] RIAA: 5× Platinum[13]
20  BPI: 18× Platinum[10] ARIA: 4× Platinum[11] BV...
21  BPI: Platinum[10] ARIA: Platinum[11] MC: 4× Pl...
22  BPI: 2× Platinum[10] ARIA: 2× Platinum[11] MC:...
23      BPI: Gold[10] MC: Gold[12] RIAA: Platinum[13]
24  BPI: 3× Platinum[10] ARIA: 3× Platinum[11] BVM...
25  BPI: Platinum[10] ARIA: Platinum[11] MC: 3× Pl...
26  "—" denotes that the recording did not chart o...

In [148]:
dfs[0].columns

MultiIndex([(               'Title',          'Title'),
            (       'Album details',  'Album details'),
            ('Peak chart positions',       'UK[1][2]'),
            ('Peak chart positions',         'AUS[3]'),
            ('Peak chart positions',         'CAN[4]'),
            ('Peak chart positions',         'FRA[5]'),
            ('Peak chart positions',         'GER[6]'),
            ('Peak chart positions',         'NOR[7]'),
            ('Peak chart positions',       'US[8][9]'),
            (      'Certifications', 'Certifications')],
           )